# Practice 1

https://github.com/guipsamora/pandas_exercises/blob/master/01_Getting_%26_Knowing_Your_Data/Chipotle/Exercise_with_Solutions.ipynb

In [2]:
import pandas as pd
import numpy as np
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
df = pd.read_csv(url, sep = '\t')
df.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [3]:
df.shape

(4622, 5)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [5]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [8]:
df_1 = df.groupby('item_name').sum().reset_index()
df_1.sort_values(['quantity'], ascending = False)
df_1.head()

               item_name  order_id  quantity
0      6 Pack Soft Drink     52322        55
1          Barbacoa Bowl     53972        66
2       Barbacoa Burrito     74718        91
3  Barbacoa Crispy Tacos      5613        12
4    Barbacoa Salad Bowl      9708        10

In [9]:
df_2 = df.groupby('choice_description').sum().reset_index()
df_2 = df_2.sort_values(['quantity'], ascending = False)
df_2.head()

                                    choice_description  order_id  quantity
15                                         [Diet Coke]    123455       159
14                                              [Coke]    122752       143
583                                           [Sprite]     80426        89
256  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     43088        49
257  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     36041        42

In [10]:
total_item_ordered = df.quantity.sum()
total_item_ordered

4972

## a. Check the item price type

In [11]:
df.item_price.dtype

dtype('O')

## b. Create a lambda function and change the type of item price

In [0]:
dollarizer = lambda x: float(x[1: -1])
df.item_price = df.item_price.apply(dollarizer)

## c. Check the item price type

In [13]:
df.item_price.dtype

dtype('float64')

In [14]:
revenue = (df['quantity']* df['item_price']).sum()
print('Revenue was: $' + str(np.round(revenue, 2)))

Revenue was: $39237.02

## How many orders were made in the period?

In [18]:
orders = df.order_id.value_counts().count()
orders

1834

## What is the average revenue amount per order?

In [21]:
df['revenue'] = df['quantity']*df['item_price']
order_grouped = df.groupby(by=['order_id']).sum()
order_grouped['revenue'].mean()

21.394231188658654

In [25]:
df.groupby('order_id').sum().mean()['revenue']

21.394231188658654

In [26]:
df.head()

   order_id  quantity  ... item_price revenue
0         1         1  ...       2.39    2.39
1         1         1  ...       3.39    3.39
2         1         1  ...       3.39    3.39
3         1         1  ...       2.39    2.39
4         2         2  ...      16.98   33.96

[5 rows x 6 columns]

In [27]:
df['item_name'].value_counts().count()

50

# Practice 2

https://github.com/guipsamora/pandas_exercises/blob/master/01_Getting_%26_Knowing_Your_Data/Occupation/Exercise_with_Solution.ipynb

In [0]:
import pandas as pd

In [37]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep = '|', index_col ='user_id')
users.reset_index().head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [38]:
users.tail()

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [39]:
users.shape

(943, 4)

## What is the number of columns in the dataset?

In [41]:
users.shape[1]

4

## The name of all the columns

In [42]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

## How is the dataset indexed

In [43]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

## What is the data type of each column?

In [46]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## Print only the occupation column

In [47]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

## How many different occupations are in this dataset?

In [50]:
users.occupation.nunique()

21

In [48]:
users.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

## What is the most frequent occupation?

In [53]:
users.occupation.value_counts().head(1).index[0]

'student'

In [54]:
# get top 5 frequent occupation
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

## Summarize the DataFrame

In [55]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## Summarize all the columns

In [56]:
users.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

## Summarize only the occupation column

In [57]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

## What is the mean age of users?

In [59]:
round(users.age.mean())

34

## What is the age with least occurrence?

In [62]:
users.age.value_counts().tail()
#7, 10, 11, 66 and 73 years -> only 1 occurrence

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

## practice 3

https://github.com/guipsamora/pandas_exercises/blob/master/01_Getting_%26_Knowing_Your_Data/World%20Food%20Facts/Exercises_with_solutions.ipynb

In [4]:
import pandas as pd
import numpy as np

In [6]:
food = pd.read_csv('en.openfoodfacts.org.products.tsv', sep = '\t')
food.head()

C:\Users\YilinYang\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (0,3,5,19,20,24,25,26,27,28,36,37,38,39,48) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,code,url,creator,created_t,created_datetime,last_modified_t,last_modified_datetime,product_name,generic_name,quantity,...,fruits-vegetables-nuts_100g,fruits-vegetables-nuts-estimate_100g,collagen-meat-protein-ratio_100g,cocoa_100g,chlorophyl_100g,carbon-footprint_100g,nutrition-score-fr_100g,nutrition-score-uk_100g,glycemic-index_100g,water-hardness_100g
0,3087,http://world-en.openfoodfacts.org/product/0000...,openfoodfacts-contributors,1474103866,2016-09-17T09:17:46Z,1474103893,2016-09-17T09:18:13Z,Farine de blé noir,NaN,1kg,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4530,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Banana Chips Sweetened (Whole),NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,14.0,14.0,NaN,NaN
2,4559,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Peanuts,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN
3,16087,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055731,2017-03-09T10:35:31Z,1489055731,2017-03-09T10:35:31Z,Organic Salted Nut Mix,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0,NaN,NaN
4,16094,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055653,2017-03-09T10:34:13Z,1489055653,2017-03-09T10:34:13Z,Organic Polenta,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## What is the number of observations in the dataset?

In [7]:
food.shape

(356027, 163)

In [8]:
food.shape[0]

356027

## What is the number of columns in the dataset?

In [9]:
food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 356027 entries, 0 to 356026
Columns: 163 entries, code to water-hardness_100g
dtypes: float64(107), object(56)
memory usage: 442.8+ MB

In [10]:
food.columns

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

## What is the name of 105th column?

In [12]:
food.columns[104]

'-glucose_100g'

In [13]:
food.index

RangeIndex(start=0, stop=356027, step=1)

## What is the product name of the 19th observation?

In [14]:
food.values[18][7]

'Lotus Organic Brown Jasmine Rice'